// Од тастатура се читаат 2 позитивни цели броеви. Доколку се внесе барем еден негативен број или 0 треба да се печати „Invalid input“.

// Треба да се определи дали помалиот број “е парен еквивалент” од поголемиот број.

// Еден број “е парен еквивалент” на друг број, ако и само ако неговите цифри се наоѓаат на парните позиции од другиот број, во истиот редослед. Соодветно да се испечатат пораки „PAREN“ и „NE“.

// Позициите треба да се сметаат оддесно-налево (најмалку значајната цифра е на позиција 1)

#include <iostream>
using namespace std;

int main() {
    int a, b, flag = 0;
    cin>>a>>b;
    int temp;
    if(a < b) {
        temp = a;
        a = b;
        b = temp;
    }
    
    if (a <= 0 || b <= 0) {
        cout<<"Invalid input";
    }
    else {
        while(b) {
            if(b%10 == a/10%10) {
                flag = 1;
            }
            else {
                flag = 0;
                break;
            }
            a = a/100;
            b = b/10;
        }
        if(flag == 1) {
        cout<<"PAREN";
    }
    else cout<<"NE";
    }
    
    return 0;
}
