// Од стандарден влез се читаат непознат број на хексадецимални цифри се додека не се внесе точка (.). 
// Ваша задача е да го пресметате декадниот збир на внесените хексадецимални цифри. Доколку добиениот декаден збир е делив со 16 се печати Pogodok. 
// Доколку истиот тој збир покрај што е делив со 16 плус завршува на 16 (последните цифри му се 1 и 6), се печати Poln pogodok инаку се печати самиот збир. 

#include <iostream>
using namespace std;

int main(){
    int n, sum=0;

    while (cin>>hex>>n) {
        sum = sum + n;
    }
    if(sum%16==0 && sum%10==6 && sum/10%10==1) {
        cout<<"Poln pogodok";
    }
    else if (sum%16==0) {
        cout<<"Pogodok";
    }
    else cout<<sum;

    return 0;
}
