// За еден природен број а велиме дека е порамнување на друг природен број b ако и само ако цифрите еднакви на 9 во бројот b се заменети со цифрата 7 во бројот а.

// Пример. Бројот 734775 е порамнување на бројот 934795.
// 
// Од стандарден влез се внесуваат непознат број на цели броеви (не повеќе од 100), се додека не се внесе нешто што не може да се интерпретира како цел број.
//
// Ваша задача е да ги отпечатите најмалите 5 од порамнувањата на сите внесени броеви, по редослед од најмалиот кон најголемиот.
//
// Забелешка: Доколку се внесат помалку од 5 броеви, тогаш печатите толку броеви колку што се соодветно внесени.
//
//Наоѓањето на порамнувањето на даден број треба да се реализира во посебна рекурзивна функција poramnet(int a).

#include <iostream>
#include <cstring>
using namespace std;

int poramnet(int a)
{
    if(a==0)
    {
        return 0;
    }

    else
    {
        int cifra=a%10;
        if(cifra==9)
        {
            return 7 + 10 * poramnet(a / 10);
        }
        else
        {
            return cifra + 10 * poramnet(a / 10);
        }
    }
}

int main()
{
    int array[100], a, i=0;

    while(cin>>a)
    {
        array[i]=a;
        i++;
    }
    
    for (int k=0; k<i-1; k++)
    {
        for (int j=0; j<i-k-1; j++)
        {
            if (poramnet(array[j])>poramnet(array[j+1]))
            {
                swap(array[j],array[j+1]);
            }
        }
    }
    
    for(int j=0; j<min(5,i); j++)
    {
        cout<<poramnet(array[j])<<" ";
    }

    return 0;
}
