// Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата). Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант.
//
// Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100). Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.
// 
// Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез. Притоа се печати сумата за првиот квадрант, па за вториот, па третиот 
// и на крај за четвртиот. Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.

#include <iostream>
#include <cstring>
using namespace std;

int main()
{
    int x, y, n, m, matrix[100][100];
    cin>>n>>m;

    for(int i=0; i<n; i++)
    {
        for(int j=0; j<m; j++)
        {
            cin>>matrix[i][j];
        }
    }
    cin.ignore();
    cin>>x>>y;

    int sum1=0, sum2=0, sum3=0, sum4=0;
    for(int i=0; i<n; i++)
    {
        for(int j=0; j<m; j++)
        {
            if(i<x && j>=y)
            {
                sum1+=matrix[i][j];
            }
            if(i<x && j<y)
            {
                sum2+=matrix[i][j];
            }
            if(i>=x && j<y)
            {
                sum3+=matrix[i][j];
            }
            if(i>=x && j>=y)
            {
                sum4+=matrix[i][j];
            }
        }
    }

    cout<<sum1<<" "<<sum2<<" "<<sum3<<" "<<sum4;

    return 0;
}
